{
    "internationalizations": [
        {
            "language": "fr",
            "description": "Mon parcours en tant que <i>programmeur</i> a commencé à l'âge de neuf ans, lorsque je suis tombé amoureux de <i>Logo</i>, un langage de programmation éducatif utilisé pour captiver les enfants dans les merveilleux domaines de la <i>Programmation</i>. Je passais des heures à essayer de créer des figures et des animations, en utilisant les mathématiques et la géométrie. À cette époque, je ne connaissais pas encore les défis excitants qui m'attendaient.<br><br>Quelques années plus tard, j'ai obtenu un stage en tant que <i>Webmaster</i>, depuis, je n'ai jamais arrêté. Cela fait plus d'une décennie que j'ai la chance de travailler avec des personnes merveilleuses, d'apprendre chaque jour, de voyager dans le monde entier et surtout, de toujours me faire de grandes amitiés.<br><br>J'ai eu une expérience entrepreneuriale, lorsqu'un ami m'a présenté <i>Magento</i>, un cadre de commerce électronique extrêmement populaire. Après avoir suivi plusieurs cours et beaucoup de pratique, j'ai obtenu des contrats avec l'agence Virtusa de Londres et de Mumbai, en Inde. Cette expérience entrepreneuriale m'a permis de voir l'autre côté de la médaille, ce qui a contribué à élargir un peu plus ma conscience en tant qu'employé.<br><br>De nos jours, je continue à chercher de nouvelles compétences, à apprendre et à partager humblement mes connaissances autant que possible."
		},
        {
            "language": "en",
            "description": "My path as a <i>programmer</i> has started at nineish years old, when I've fallen in love with <i>Logo</i>, an educational programming language used to captivate kids in the wonderful lands of <i>Programming</i>. I used to spend hours in a row trying to build figures and animations, using math and geometry. At that time, I just did not know the exciting challenges that were yet to come.<br><br>A few years later, I got an internship as a <i>Webmaster</i>, since then, I have never stopped. It has been more than a decade, where I'm having the chance to work with marvelous people, learning every day, traveling the world, and mainly, always making great friendships.<br><br>I had an entrepreneurship experience, when a friend of mine presented me <i>Magento</i>, an extremely popular e-commerce framework. After doing several courses and a lot of practice, I got contracts with the agencies from London and Mumbai, India, of Virtusa. This entrepreneurship experience gave me the chance to see the other side of the coin, which contributed to sort of expand a bit more my consciousness as an employee.<br><br>Nowadays, I keep seeking new skills, learning and sharing my humble knowledge as much as possible."
        }
    ],
    "medias": [        
        {
            "icon": "linkedin",
            "title": "LinkedIn",
            "http": "https://www.linkedin.com/in/daniel-desplaces/"
        },
        {
            "icon": "github",
            "title": "GitHub",
            "http": "https://github.com/DanDWD"
        },
        {
            "icon": "facebook",
            "title": "Facebook",
            "http": "https://www.facebook.com/"
        }
    ],
    "hobbies": [        
        {
            "icon": "biking",
            "title": "Cycling"
        },
        {
            "icon": "dumbbell",
            "title": "Gym"
        },
        {
            "icon": "suitcase-rolling",
            "title": "Travel"
        },
        {
            "icon": "book",
            "title": "Read"
        }
    ]
}