[
    {
        "thumbnail": "assets/posts/post-11-03-2019.jpg",
        "http": "https://www.linkedin.com/",
        "date": "11-03-2019",
        "internationalizations": [
            {
                "language": "en",
                "title": "The anti-traversing 2D Array formula.",
                "description": "Have you ever thought about the <b>mathematical relation</b> between the <i>columns</i> and <i>rows</i> of a bidimensional array <i>(2d matrix)</i>? This data structure hides a <b>data location formula</b> that helped me to avoid the <i>time complexity of O(n²)</i>, which is a terrible scenario, turning it into a <i>constant time complexity - O(1)</i>. A full explanation, with real test cases and Unit Tests are waiting for you."
            },
            {
                "language": "fr",
                "title": "La formule du réseau 2D anti-traversant.",
                "description": "Avez-vous déjà pensé à la <b>relation mathématique</b> entre les <i>colonnes</i> et les <i>lignes</i> d'un tableau bidimensionnel <i>(matrice 2D)</i>? Cette structure de données cache une <b>formule de localisation des données</b> qui m'a aidé à éviter la <i>complexité temporelle de O(n²)</i>, ce qui est un scénario terrible, en la transformant en une <i>complexité temporelle constante - O(1)</i>. Une explication complète, avec des cas de test réels et des tests unitaires vous attendent."
			}
        ]
    },
    {
        "thumbnail": "assets/posts/post-01-15-2019.jpg",
        "http": "https://www.linkedin.com/",
        "date": "01-15-2019",
        "internationalizations": [
            {
                "language": "en",
                "title": "In 2019, get out of unemployment! Be a Web Developer.",
                "description": "There were numerous vacancies for <i>web developers</i> on the wall, at the same time, <b>12.7 million people were unemployed</b> in Brazil, such a sad situation persisted in my mind. Back at my house, I've recalled a free course, offered by the renowned <i>Bob Tabor (Senior Program Manager at Microsoft)</i>, present at Microsoft Virtual Academy."
            },
            {
                "language": "fr",
                "title": "En 2019, sortez du chômage ! Devenez développeur web.",
				"description": "Là, sur le panneau, il y avait d'innombrables offres d'emploi pour développeur web. Et en même temps, il y avait <b>12,7 millions de compatriotes au chômage</b> et ces offres vacantes tournaient dans ma tête. De retour chez moi, je me souviens d'un cours gratuit, offert par le renommé <i>Bob Tabor (Senior Program Manager chez Microsoft)</i>, disponible sur la Microsoft Virtual Academy."
			}
        ]
    },
    {
        "thumbnail": "assets/posts/post-07-10-2016.jpg",
        "http": "https://www.linkedin.com/",
        "date": "07-10-2016",
        "internationalizations": [
            {
                "language": "en",
                "title": "Map Item Navigation for Android - <i>Open-source component</i>.",
                "description": "For great user experience, the usage of maps together with the ordered list is used very often in mobile applications. This article presents an open-source application for Android that provides a fully functional component."
            },
            {
                "language": "fr",
                "title": "Navigation par élément sur la carte pour Android - <i>Composant open source</i>.",
				"description": "Pour une excellente expérience utilisateur, l'utilisation de cartes avec une liste ordonnée est très fréquente dans les applications mobiles. Cet article présente une application open source pour Android qui fournit un composant entièrement fonctionnel."
			}
        ]
    },
    {
        "thumbnail": "assets/posts/post-05-07-2016.jpg",
        "http": "https://www.linkedin.com/",
        "date": "05-07-2016",
        "internationalizations": [
            {
                "language": "en",
                "title": "Geo Distance search with MySQL & PHP.",
                "description": "Nowadays, <b>geolocation</b> is essential for most of the basic daily activities. Who never have asked Google where is the closest market?  In this article, I show a practical example of how to create a <i>SQL Query</i> that does a geolocational search based on a radius range and a fixed geolocational point."
            },
            {
                "language": "fr",
                "title": "Recherche par distance géographique avec MySQL et PHP.",
				"description": "Actuellement, la <b>géolocalisation</b> est essentielle pour la plupart des activités quotidiennes de base. Qui n'a jamais demandé à Google où se trouve le supermarché le plus proche ? Dans cet article, je montre un exemple pratique de création d'une <i>requête SQL</i> qui effectue une recherche géolocalisée en fonction d'un rayon d'action et d'un point géographique fixe."
		}
        ]
    },
    {
        "thumbnail": "assets/posts/post-06-18-2016.jpg",
        "http": "https://www.linkedin.com/",
        "date": "06-18-2016",
        "internationalizations": [
            {
                "language": "en",
                "title": "Sending authenticated email in PHP.",
                "description": "With the appliance of the email security policy on the <i>Web 2.0</i> came the need to take measures that would hinder the practice of <i>spamming</i>, among the measures taken,  it is the use of authenticated e-mail, which means that for each e-mail sent, we would have the <i>signature</i> of the host who sent it, thus, there would be greater control over who, eventually, practice the spamming. In this article, I show you how to send the authenticate e-mail, increasing the chances of your email get read by the target user."
            },
            {
                "language": "fr",
                "title": "Envoi d'e-mail authentifié en PHP.",
				"description": "Avec l'application de la politique de sécurité des e-mails dans la <i>Web 2.0</i>, est apparue la nécessité de prendre des mesures pour rendre la pratique du <i>spamming</i> plus difficile. Parmi les mesures adoptées, il y a l'utilisation d'e-mails authentifiés, ce qui signifie que pour chaque e-mail envoyé, nous aurions la <i>signature</i> de l'hôte qui l'a envoyé, permettant ainsi un meilleur contrôle sur ceux qui pratiqueraient éventuellement le spam. Dans cet article, je montrerai comment envoyer l'e-mail d'authentification, augmentant ainsi les chances que votre e-mail soit lu par l'utilisateur destinataire."
		}
        ]
    },
    {
        "thumbnail": "assets/posts/post-06-04-2016.jpg",
        "http": "https://www.linkedin.com/",
        "date": "06-04-2016",
        "internationalizations": [
            {
                "language": "en",
                "title": "Sharing Intent for Android - <i>Open-source component</i>.",
                "description": "Applications like <i>Whatsapp, Facebook, Twitter, Snapchat, etc...</i> have the ability to receive content to be shared. This gives us a wide range of possibilities, being possible to share videos, texts, URLs and even the application's page in the PlayStore for users to install your application."
            },
            {
                "language": "fr",
                "title": "Partage pour Android - <i>Composant open source</i>.",
				"description": "Des applications comme <i>Whatsapp, Facebook, Twitter, Snapchat, etc...</i> ont la capacité de recevoir du contenu à partager. Cela nous offre une large gamme de possibilités, permettant de partager des vidéos, des textes, des URL et même la page d'applications de la PlayStore afin que d'autres utilisateurs installent votre application."
			}
        ]
    },
    {
        "thumbnail": "assets/posts/post-05-28-2016.jpg",
        "http": "https://www.linkedin.com/",
        "date": "05-28-2016",
        "internationalizations": [
            {
                "language": "en",
                "title": "Contact List for Android - <i>Open-source component</i>.",
                "description": "When developing a mobile application, you will be facing the need to facilitate the life of your user when sharing your application among its friends. For this, I have created the ContactPickerList, a simple and practical way to access the phonebook contact list."
            },
            {
                "language": "fr",
                "title": "Liste de contacts pour Android - <i>Composant open source</i>.",
				"description": "Lors du développement d'une application mobile, vous serez confronté à la nécessité de faciliter la vie de votre utilisateur pour qu'il puisse partager votre application avec ses amis. Pour cela, j'ai créé ContactPickerList, une façon simple et pratique d'accéder à la liste de contacts de l'agenda."
		}
        ]
    },
    {
        "thumbnail": "assets/posts/post-05-14-2016.jpg",
        "http": "https://www.linkedin.com/",
        "date": "05-14-2016",
        "internationalizations": [
            {
                "language": "en",
                "title": "Tinder Slide Card for Android - <i>Open-source component</i>.",
                "description": "Who has never encountered a push notification before? All of us smartphone users see them every day. In this article, I will teach you how to send notifications almost in real-time to any android device such as smartphone, smartwatch, etc."
            },
            {
                "language": "fr",
                "title": "Tinder Slide Card pour Android - <i>Composant open source</i>.",
				"description": "Qui n'a jamais rencontré une notification utilisateur auparavant ? Nous les voyons tous les jours, nous, utilisateurs de smartphones. Dans cet article, je vais vous apprendre comment envoyer des notifications presque en temps réel à n'importe quel appareil Android, tel qu'un smartphone, une smartwatch, etc."
			}
        ]
    },
    {
        "thumbnail": "assets/posts/post-05-21-2016.jpg",
        "http": "https://www.linkedin.com/",
        "date": "05-21-2016",
        "internationalizations": [
            {
                "language": "en",
                "title": "Push Notification for Android - <i>Open-source component</i>.",
                "description": "A complete component for those who need a deck of dynamic cards woth interactive charts for Android. Much like what we found in <i>Tinder</i>. Fully open-source for changes and improvements."
            },
            {
                "language": "fr",
                "title": "Notification d'utilisateur sur Android - <i>Composant open source</i>.",
				"description": "Un composant complet pour ceux qui ont besoin d'un jeu de cartes dynamiques avec des graphiques interactifs pour Android. Très similaire à ce que l'on trouve sur <i>Tinder</i>. Code source entièrement ouvert pour les modifications et les améliorations."
			}
        ]
    }
]
